# -*- coding: utf-8 -*-
"""
-------------------------------------------------
Project Name:   gurobi 
File Name：     demo2_11
Description :   Numpy 的数组运算
                主要是 Numpy 中的 array 运算操作
                +   矩阵对应的元素相加
                -   矩阵对应的元素相减
                *   矩阵对应的元素相乘
                /   矩阵对应元素相处，如果都是整数则取商
                %   矩阵对应元素相除后取余数
                **  矩阵每个元素都取 n 次方，如 " ** 2 " 指每个元素都取平方
Author :        Steven.zou
E-mail:         zoushiqi0404@gmail.com
Date：          2020-11-26 18:57
Software:       PyCharm
-------------------------------------------------
 Change Activity:
                   2020-11-26:
-------------------------------------------------
"""
# Numpy 数组运算
import numpy as np

a1 = np.array([[4, 5, 6], [1, 2, 3]])
a2 = np.array([[6, 5, 4], [3, 2, 1]])

# 矩阵对应元素相加
print(a1 + a2)
# [[10 10 10]
#  [ 4  4  4]]

# 矩阵对应元素相除，如果都是整数则取商
print(a1 / a2)
# [[0.66666667 1.         1.5       ]
#  [0.33333333 1.         3.        ]]

# 矩阵对应元素相除后取余数
print(a1 % a2)
# [[4 0 2]
#  [1 0 0]]

# 矩阵每个元素都取 n 次方
print(a1 ** 3)
# [[ 64 125 216]
#  [  1   8  27]]
